pbatsa/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
  /* Do not log successful drive-PID updates here: this handler runs in the USB
   * RX path and hardware_bridge intentionally re-sends the packet in bursts
   * after reconnect. Printing each success over the debug UART can stall long
   * enough to starve the main loop and re-trigger the watchdog reboot loop. */
}

#ifdef OPTION_PERIMETER
static volatile uint8_t perimeter_signal_code = 0u;

static void on_set_perimeter_listen(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_perimeter_listen_t) - 2u) {
    return;
  }

  const pkt_set_perimeter_listen_t *pkt =
      reinterpret_cast<const pkt_set_perimeter_listen_t *>(data);

  perimeter_signal_code = pkt->signal_code;
  Perimeter_ListenOn(pkt->signal_code);
}
#endif

static void on_hl_state(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_hl_state_t) - 2u) {
    return;
  }

  const pkt_hl_state_t *pkt = reinterpret_cast<const pkt_hl_state_t *>(data);

  hl_current_mode = pkt->current_mode;
  hl_gps_quality = pkt->gps_quality;

  // Update panel LEDs based on mode
  if (hl_gps_quality < 90) {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
  } else {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
  }

  // Map host mode to internal status for motor safety.
  // Constants defined in mowgli_protocol.h — keep in sync with
  // HighLevelStatus.msg.
  switch (hl_current_mode) {
  case HL_MODE_AUTONOMOUS:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_RECORDING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
    break;
  case HL_MODE_MANUAL_MOWING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_NULL:
  case HL_MODE_IDLE:
  default:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
    left_target_mps = right_target_mps = 0.0f;
    blade_on_off = target_blade_on_off = 0;
    break;
  }

  update_blade_led();
}

static void on_cmd_blade(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_blade_t) - 2u) {
    return;
  }

  const pkt_cmd_blade_t *pkt = reinterpret_cast<const pkt_cmd_blade_t *>(data);
  /* Defense-in-depth: never arm the blade target while IDLE/docked. The
   * authoritative gate is in motors_handler (which zeroes blade_on_off in
   * IDLE every tick), but refusing to latch the target here keeps state
   * consistent and avoids an instantaneous spin-up on the IDLE→MOWING edge.
   * blade_dir is still accepted so direction is correct once mowing starts. */
  if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
    target_blade_on_off = 0;
  } else {
    target_blade_on_off = pkt->blade_on;
  }
  blade_direction = pkt->blade_dir;
}

/* Host -> Firmware reboot request. Sets reboot_flag so chatter_handler issues
 * NVIC_SystemReset on its next tick (lets the current packet/ISR unwind first).
 * Gated on the magic byte so a corrupt/misframed packet can't reset the board.
 */
static void on_reboot(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_reboot_t) - 2u) {
    return;
  }
  const pkt_reboot_t *pkt = reinterpret_cast<const pkt_reboot_t *>(data);
  if (pkt->magic == PKT_REBOOT_MAGIC) {
    debug_printf("reboot requested by host\r\n");
    reboot_flag = true;
  }
}

/* Host -> Firmware config/version request. Replies with this firmware's
 * wire-protocol version (the compatibility key the host checks) and its
 * human-readable semver, so the ROS 2 image can confirm it is talking to a
 * compatible firmware and warn the operator to reflash on mismatch. Firmware
 * older than this handshake never registers this handler, so it simply never
 * replies — which the host reads as "incompatible firmware". */
static void on_config_req(const uint8_t *data, size_t len) {
  if (len < 1u) {
    return;
  }
  const uint8_t flags = (len >= 2u) ? data[1] : 0u;
  g_firmware_debug_enabled = (flags & CONFIG_FLAG_FIRMWARE_DEBUG) != 0u ? 1u : 0u;

  pkt_config_rsp_t rsp;
  rsp.type = PKT_ID_CONFIG_RSP;
  rsp.protocol_version = MOWGLI_PROTOCOL_VERSION;
  rsp.active_flags = g_firmware_debug_enabled != 0u ? CONFIG_FLAG_FIRMWARE_DEBUG : 0u;
  rsp.fw_version_major = MOWGLI_FW_VERSION_MAJOR;
  rsp.fw_version_minor = MOWGLI_FW_VERSION_MINOR;
  rsp.fw_version_patch = MOWGLI_FW_VERSION_PATCH;
  mowgli_comms_send(&rsp, sizeof(rsp));
}

/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void) {
  if (target_blade_on_off) {
#ifdef PANEL_LED_2H
    if (BLADEMOTOR_bActivated) {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
    } else {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
    }
#endif
  } else {
#ifdef PANEL_LED_2H
    PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
#endif
  }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len) {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_PROCESS);
  mowgli_comms_process_rx(Buf, (size_t)len);
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_EXIT);
  return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len) {
  CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler() {
  if (NBT_handler(&led_nbt)) {
    HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

