pbatsa/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    if (reboot_flag) {
      NVIC_SystemReset();
    }
  }
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler() {
  if (NBT_handler(&motors_nbt)) {
    /* Snapshot ISR-written variables under interrupt lock */
    __disable_irq();
    float snap_left_target = left_target_mps;
    float snap_right_target = right_target_mps;
    uint8_t snap_target_blade = target_blade_on_off;
    uint32_t snap_heartbeat = last_heartbeat_tick;
    uint32_t snap_cmd_vel = last_cmd_vel_tick;
    float snap_ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    __enable_irq();

    blade_on_off = snap_target_blade;

    /* --- decide effective target ---
     * Emergency or cmd_vel watchdog timeout overrides to a hard stop.
     * Otherwise the snapshot value drives the PI loop below. */
    bool hard_stop = false;
    if (Emergency_State()) {
      hard_stop = true;
      blade_on_off = 0;
    } else if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
      /* Re-assert the IDLE gate HERE — in the one place that actually
       * drives the wheels AND the blade — so the "never move / never
       * spin the blade while idle/docked" guarantee holds regardless of
       * the relative arrival order of CMD_PWM, CMD_BLADE and HL_STATE.
       * on_hl_state zeroes the targets when the IDLE packet arrives, but
       * a CMD_BLADE(on=1) arriving AFTER it would otherwise re-arm the
       * blade with no gate (on_cmd_blade is fire-and-forget). Firmware is
       * the sole blade safety authority. */
      hard_stop = true;
      blade_on_off = 0;
    } else {
      const uint32_t cmd_vel_age_ms = HAL_GetTick() - snap_cmd_vel;
      if (cmd_vel_age_ms > 200u) {
        /* Command-vel watchdog: zero motors if the host hasn't
         * sent a twist in 200 ms (Pi hang, USB glitch, etc). */
        hard_stop = true;
      }
      if (cmd_vel_age_ms > 25000u) {
        blade_on_off = 0;
      }
    }

    const float l_target = hard_stop ? 0.0f : snap_left_target;
    const float r_target = hard_stop ? 0.0f : snap_right_target;

#if USE_WHEEL_PI
    /* Wheel-level PI loop.
     *
     * Reads the signed cumulative encoder count maintained by
     * drivemotor.c, derives actual_mps over the 20 ms loop
     * period, computes a feedforward + PI PWM. The integrator
     * is what bridges the static-friction deadband: while the
     * target says "move 0.05 m/s" and the encoder says "0",
     * Ki × error × dt accumulates until the PWM crosses the
     * deadband (~40), the motor breaks free, the wheel starts
     * counting ticks, error drops, and the integrator settles
     * at whatever PWM keeps that wheel at target speed.
     *
     * Read left_ticks_signed/right_ticks_signed directly (these are
     * 32-bit and updated from the drivemotor rx-decode path —
     * not strictly atomic, but a torn read here costs at most
     * one 20 ms loop of incorrect velocity, then converges). */
    const int32_t cur_left_ticks = left_ticks_signed;
    const int32_t cur_right_ticks = right_ticks_signed;
    const int32_t dleft_ticks = cur_left_ticks - prev_left_ticks_signed_pi;
    const int32_t dright_ticks = cur_right_ticks - prev_right_ticks_signed_pi;
    prev_left_ticks_signed_pi = cur_left_ticks;
    prev_right_ticks_signed_pi = cur_right_ticks;

    const float l_actual_mps =
        ((float)dleft_ticks) / snap_ticks_per_meter / WHEEL_PI_DT_S;
    const float r_actual_mps =
        ((float)dright_ticks) / snap_ticks_per_meter / WHEEL_PI_DT_S;

    /* Reset the integrator on direction reversal / stop-to-go / hard-stop.
     * Without this the integral built up while decelerating would drive the
     * motor backwards as soon as the chassis stopped (micro-oscillation). */
    const bool l_target_sign_changed =
        (l_target * prev_left_target_mps < 0.0f) ||
        (l_target == 0.0f && prev_left_target_mps != 0.0f) || hard_stop;
    const bool r_target_sign_changed =
        (r_target * prev_right_target_mps < 0.0f) ||
        (r_target == 0.0f && prev_right_target_mps != 0.0f) || hard_stop;
    if (l_target_sign_changed) {
      left_wheel_pid.resetIntegral();
      left_wheel_pid.resetDerivative();
    }
    if (r_target_sign_changed) {
      right_wheel_pid.resetIntegral();
      right_wheel_pid.resetDerivative();
    }
    prev_left_target_mps = l_target;
    prev_right_target_mps = r_target;

    /* Conditional-integration anti-windup, DIRECTION-AWARE: freeze the
     * integrator only in the direction that would worsen an already-
     * saturated output; always allow it to unwind OUT of saturation. Keying
     * on the error sign (not just the saturation bit) avoids a one-
     * directional integral latch — e.g. on overspeed (err < 0) while the
     * output is railed high, the integrator must still be able to wind down
     * to cut PWM. *_pwm_signed is the previous cycle's total (feedforward +
     * trim), saturated by DRIVEMOTOR_SetSpeedSigned at ±255. This sits on
     * top of the PID's own ±100 integral-magnitude clamp. */
    const float l_err = l_target - l_actual_mps;
    const float r_err = r_target - r_actual_mps;
    const bool l_update_integral = !((left_pwm_signed >= 255 && l_err > 0.0f) ||
                                     (left_pwm_signed <= -255 && l_err < 0.0f));
    const bool r_update_integral =
        !((right_pwm_signed >= 255 && r_err > 0.0f) ||
          (right_pwm_signed <= -255 && r_err < 0.0f));

    /* Closed-loop PI trim (Kp·err + integrator; D gain = 0). The PID
     * computes error = setpoint − feedback internally and integrates AFTER
     * forming the output (PX4 form), so a fresh integral increment reaches
     * the actuator one 50 Hz cycle later than the old integrate-before form
     * — steady-state identical, ~20 ms transient shift (immaterial here). */
    left_wheel_pid.setSetpoint(l_target);
    right_wheel_pid.setSetpoint(r_target);
    const float l_trim =
        left_wheel_pid.update(l_actual_mps, WHEEL_PI_DT_S, l_update_integral);
    const float r_trim =
        right_wheel_pid.update(r_actual_mps, WHEEL_PI_DT_S, r_update_integral);

    /* Open-loop feedforward (deadband-bridge, preserves the above-deadband
     * mapping) + closed-loop PI trim. Sign carried through. */
    const float l_pwm_f = l_target * g_pwm_per_mps + l_trim;
    const float r_pwm_f = r_target * g_pwm_per_mps + r_trim;

    /* When the target is exactly zero AND we're not braking from a
     * larger speed, force PWM to zero outright — avoids the residual
     * "hum" from a non-zero integral applied to a stopped wheel. */
    left_pwm_signed = (l_target == 0.0f && fabsf(l_actual_mps) < 0.02f)
                          ? 0
                          : (int16_t)l_pwm_f;
    right_pwm_signed = (r_target == 0.0f && fabsf(r_actual_mps) < 0.02f)
                           ? 0
                           : (int16_t)r_pwm_f;
#else
    /* Open-loop fallback for bring-up / regression A/B. Replicates the
     * pre-PI mapping exactly: PWM = target × PWM_PER_MPS, no encoder
     * feedback, no integrator. */
    left_pwm_signed = (int16_t)(l_target * g_pwm_per_mps);
    right_pwm_signed = (int16_t)(r_target * g_pwm_per_mps);
#endif

