pbatsa/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
    pkt_status_t status_pkt;
    status_pkt.type = PKT_ID_STATUS;

    // Build status bitmask
    uint8_t status_bits = STATUS_BIT_INITIALIZED | STATUS_BIT_RASPI_POWER;
    if (chargecontrol_is_charging) {
      status_bits |= STATUS_BIT_CHARGING;
    }
    if (RAIN_Sense()) {
      status_bits |= STATUS_BIT_RAIN;
    }
    // Sound and UI availability from panel
    status_bits |= STATUS_BIT_UI_AVAIL;
    status_pkt.status_bitmask = status_bits;

    // USS ranges — fill from ultrasonic sensors
    for (unsigned int i = 0; i < MOWGLI_USS_COUNT; i++) {
      status_pkt.uss_ranges_m[i] = 0.0f;
    }
#if OPTION_ULTRASONIC == 1
    status_pkt.uss_ranges_m[0] =
        (float)(ULTRASONICSENSOR_u32GetLeftDistance()) / 10000.0f;
    status_pkt.uss_ranges_m[1] =
        (float)(ULTRASONICSENSOR_u32GetRightDistance()) / 10000.0f;
#endif

    // Emergency bitmask
    uint8_t emergency_bits = 0u;
    if (Emergency_State()) {
      emergency_bits |= EMERGENCY_BIT_LATCH;
      if (Emergency_StopButtonYellow() || Emergency_StopButtonWhite()) {
        emergency_bits |= EMERGENCY_BIT_STOP;
      }
      if (Emergency_WheelLiftBlue() || Emergency_WheelLiftRed()) {
        emergency_bits |= EMERGENCY_BIT_LIFT;
      }
    }
    status_pkt.emergency_bitmask = emergency_bits;

    // Power
    status_pkt.v_charge = charge_voltage;
    status_pkt.v_system = battery_voltage;
    status_pkt.charging_current = current;
    status_pkt.batt_percentage = 0; // TODO: compute from voltage curve

    pkt_reset_cause_t reset_pkt;
    reset_pkt.type = PKT_ID_RESET_CAUSE;
    reset_pkt.reset_cause = g_boot_reset_cause_code;
    reset_pkt.last_stage_before_reset = g_boot_last_watchdog_stage_code;
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_RESET_SEND);
    mowgli_comms_send(&reset_pkt, sizeof(reset_pkt));
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_STATUS_SEND);
    mowgli_comms_send_status(&status_pkt);
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
    return;
  }

  if (nbt_due(&imu_nbt, now_tick)) {
    const uint32_t imu_wire_bytes = usb_cdc_framed_packet_size(sizeof(pkt_imu_t));
    if (!usb_cdc_should_send_telemetry_packet(imu_wire_bytes)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }

    nbt_consume(&imu_nbt, now_tick);
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_IMU_BUILD);

    static uint32_t last_imu_tick = 0;
    float ax = 0.0f;
    float ay = 0.0f;
    float az = 0.0f;
    float gx = 0.0f;
    float gy = 0.0f;
    float gz = 0.0f;
    float mx = 0.0f;
    float my = 0.0f;
    float mz = 0.0f;

#ifdef EXTERNAL_IMU_ACCELERATION
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_IMU_ACCEL);
    if (!IMU_TryReadAccelerometer(&ax, &ay, &az)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }
#endif

#ifdef EXTERNAL_IMU_ANGULAR
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_IMU_GYRO);
    if (!IMU_TryReadGyro(&gx, &gy, &gz)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }
#endif

    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_IMU_MAG);
    if (!IMU_TryReadMag(&mx, &my, &mz)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }

    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_IMU_PACKET_FILL);

    pkt_imu_t imu_pkt = {};
    imu_pkt.type = PKT_ID_IMU;
    imu_pkt.dt_millis = (uint16_t)(now_tick - last_imu_tick);
    last_imu_tick = now_tick;
    imu_pkt.acceleration_mss[0] = ax;
    imu_pkt.acceleration_mss[1] = ay;
    imu_pkt.acceleration_mss[2] = az;
    imu_pkt.gyro_rads[0] = gx;
    imu_pkt.gyro_rads[1] = gy;
    imu_pkt.gyro_rads[2] = gz;
    imu_pkt.mag_uT[0] = mx;
    imu_pkt.mag_uT[1] = my;
    imu_pkt.mag_uT[2] = mz;

    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_IMU_SEND);
    mowgli_comms_send_imu(&imu_pkt);
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
    return;
  }

#ifdef OPTION_PERIMETER
  if (last_heartbeat_tick != 0u && nbt_due(&perimeter_nbt, now_tick)) {
    const uint32_t perimeter_wire_bytes =
        usb_cdc_framed_packet_size(sizeof(pkt_perimeter_wire_t));
    if (!usb_cdc_should_send_telemetry_packet(perimeter_wire_bytes)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }

    nbt_consume(&perimeter_nbt, now_tick);

    float left = 0.0f;
    float center = 0.0f;
    float right = 0.0f;
    if (Perimeter_UpdateMsg(&left, &center, &right)) {
      pkt_perimeter_wire_t pkt = {};
      pkt.type = PKT_ID_PERIMETER_WIRE;
      pkt.signal_code = perimeter_signal_code;
      pkt.left_correlation = left;
      pkt.center_correlation = center;
      pkt.right_correlation = right;
      mowgli_comms_send(&pkt, sizeof(pkt));
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }
  }
#endif

  // Blade motor status (4 Hz) — only after system has initialized
  if (last_heartbeat_tick != 0u && nbt_due(&blade_nbt, now_tick)) {
    const uint32_t blade_wire_bytes =
        usb_cdc_framed_packet_size(sizeof(pkt_blade_status_t));
    if (!usb_cdc_should_send_telemetry_packet(blade_wire_bytes)) {
      WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
      return;
    }

    nbt_consume(&blade_nbt, now_tick);

    pkt_blade_status_t blade_pkt = {};
    blade_pkt.type = PKT_ID_BLADE_STATUS;
    blade_pkt.is_active = BLADEMOTOR_bActivated ? 1u : 0u;
    blade_pkt.rpm = BLADEMOTOR_u16RPM;
    blade_pkt.power_watts = BLADEMOTOR_u16Power;
    blade_pkt.temperature = blade_temperature;
    blade_pkt.error_count = BLADEMOTOR_u32Error;
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_BLADE_SEND);
    mowgli_comms_send(&blade_pkt, sizeof(blade_pkt));
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
    return;
  }

  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_BROADCAST_EXIT);
}

/* ---------------------------------------------------------------------------
 * spinOnce — no-op (rosserial spin removed)
 * ---------------------------------------------------------------------------*/
extern "C" void spinOnce() {
  // Nothing to do — COBS RX is handled in CDC_DataReceivedHandler().
  // This function is kept so main.c doesn't need modification.
}

/* ---------------------------------------------------------------------------
 * Initialisation (replaces init_ROS)
 * ---------------------------------------------------------------------------*/
extern "C" void init_ROS() {
  // Initialise COBS comms layer
  mowgli_comms_init();

  // Register handlers for Host -> Firmware packets
  mowgli_comms_register_handler(PKT_ID_HEARTBEAT, on_heartbeat);
  mowgli_comms_register_handler(PKT_ID_CMD_VEL, on_cmd_vel);
  mowgli_comms_register_handler(PKT_ID_HL_STATE, on_hl_state);
  mowgli_comms_register_handler(PKT_ID_CMD_BLADE, on_cmd_blade);
  mowgli_comms_register_handler(PKT_ID_REBOOT, on_reboot);
  mowgli_comms_register_handler(PKT_ID_SET_DRIVE_PID, on_set_drive_pid);
  mowgli_comms_register_handler(PKT_ID_CONFIG_REQ, on_config_req);
#ifdef OPTION_PERIMETER
  mowgli_comms_register_handler(PKT_ID_SET_PERIMETER_LISTEN,
                                on_set_perimeter_listen);
#endif

  // Initialise timers
  NBT_init(&led_nbt, LED_NBT_TIME_MS);
  NBT_init(&panel_nbt, PANEL_NBT_TIME_MS);
  NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
  NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
  NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
  NBT_init(&blade_nbt, BLADE_NBT_TIME_MS);
#ifdef OPTION_PERIMETER
  NBT_init(&perimeter_nbt, PERIMETER_NBT_TIME_MS);
#endif

#if USE_WHEEL_PI
  // Per-wheel velocity PI gains/limits (vendored PX4 PID, pid.hpp). D=0 — no
  // derivative on a velocity loop. Gains/limits are in PWM units, matching the
  // hand-rolled loop they replace (Kp·err + integrator, integral clamp ±100,
  // output clamp ±255). The PID adds derivative-on-measurement (unused at D=0)
  // and conditional-integration anti-windup.
  left_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S,
                          0.0f);
  left_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(WHEEL_PI_KP_PWM_PER_MPS, WHEEL_PI_KI_PWM_PER_MPS_S,
                           0.0f);
  right_wheel_pid.setIntegralLimit(WHEEL_PI_INT_MAX_PWM);
  right_wheel_pid.setOutputLimit(255.0f);
#endif

  last_odom_tick = HAL_GetTick();
  last_heartbeat_tick = 0;
  last_cmd_vel_tick = 0;
}

float clamp(float d, float min, float max) {
  const float t = d < min ? min : d;
  return t > max ? max : t;
}
